jmper-ha/jradio/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Pool reserved for allocations that must be internal (DMA descriptors, task
# stacks). The hardware AES driver takes MALLOC_CAP_DMA memory for every TLS
# record, and PSRAM never carries that flag; with the I2S DMA buffers holding
# ~16 KB during playback, this pool is what HTTPS streaming competes for.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
# Plain malloc() below this size prefers internal RAM. The ESP-IDF default of
# 16384 sends almost every allocation in this firmware there, crowding out the
# DMA-capable memory the AES driver needs; 1024 keeps only small, latency
# sensitive allocations internal and pushes the rest to PSRAM.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# 14 is not decoration: ui_font_cyrillic_14 falls back to it for the LV_SYMBOL_*
# glyphs, which its own ASCII+Cyrillic ranges do not cover. 24 and 48 are the
# feed carousel's icons.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y
# The settings screen turns its address band into a QR code on a click, which
# is the only way a phone gets to the web UI without someone typing an IP by
# hand - and in setup mode the only way it joins the box's access point at all.
CONFIG_LV_USE_QRCODE=y
CONFIG_FREERTOS_HZ=1000
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# The decode loop reads the socket once per decoded frame, and a frame is held
# by a blocking I2S write - about 85 ms for FLAC. So the most a station can
# deliver is one receive window per frame, and a 16 KB window put the ceiling
# at roughly 140 KB/s once a French server's round trip is counted. That is
# under what 48 kHz 24-bit FLAC needs: those stations ran at 86% of real time
# with ~120 underruns per 10 s until this was doubled, and at 98-100% after.
# 48 KB was measured too and is far worse - 23-73% with hundreds of underruns,
# the window outgrowing what the Wi-Fi RX buffers can absorb.
CONFIG_LWIP_TCP_WND_DEFAULT=32768
# Has to cover the window in MSS-sized segments: 32768/1440 is 22.8.
CONFIG_LWIP_TCP_RECVMBOX_SIZE=24
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC is not set
CONFIG_HTTPD_WS_SUPPORT=y
# Keep the whole network path on core 0, where the Wi-Fi task is already
# pinned. The lwIP task runs at priority 18 - above everything this project
# creates - so leaving it unpinned let it preempt the audio decoder on core 1
# mid-stream.
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
# Must cover the httpd session pool (WEB_SOCKET_SERVER_SOCKET_CAPACITY, see
# web_socket.h) plus the internet radio's streaming HTTP client socket and a
# few spares for DNS/mDNS lookups. The pool is 12 with six WebSocket clients,
# so 16 leaves exactly the three spares that rule asks for and nothing more:
# raising the client count again means raising this too.
CONFIG_LWIP_MAX_SOCKETS=16
# Nothing here speaks IPv6: no source file references it, autoconfig was off,
# and the router hands out IPv4. Measured cost of leaving it on: 33 KB of
# flash and 1.8 KB of internal SRAM, the latter being the scarce one - TLS
# needs DMA-capable internal memory, which is what made HTTPS streams fail
# before. Note this also fixes TCP_MSS at 1440: that value is the IPv6 ceiling
# (1500 - 40 - 20), and only an IPv4-only build may raise it to 1460.
# CONFIG_LWIP_IPV6 is not set
# VFS slots. The default is 8, and this firmware peaks at exactly that:
# /dev/uart and friends, /littlefs, /usb0 and /sd0. That is one too few,
# because esp_vfs_register_fs() refuses on `s_vfs_count >= VFS_MAX_COUNT`
# before it ever looks for a free slot - and s_vfs_count is a high-water mark
# that esp_vfs_unregister() never lowers. So once the peak touches the limit,
# every later registration fails with ESP_ERR_NO_MEM even though slots are
# free, and the SD card - which registers and unregisters on every visit to
# its source - never mounts again until a reboot.
CONFIG_VFS_MAX_COUNT=12
# Two FAT volumes: the USB flash drive at /usb0 and the SD card at /sd0. Two is
# also the IDF default, so this line only pins it - dropping it to one would
# leave whichever mounted second with nowhere to go.
CONFIG_FATFS_VOLUME_COUNT=2
# Without long-file-name support
# readdir() returns 8.3 aliases, which makes a music browser useless: a track
# named in Russian comes back as "______~1.MP3", identical for every such file.
# UTF-8 API encoding hands those names straight to LVGL and the web UI, and
# code page 866 keeps the DOS short-name aliases Cyrillic rather than 437.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_CODEPAGE_866=y
# One lost segment used to cost the whole window. Without SACK the sender
# retransmits everything from the loss onwards, and with room for only four
# out-of-order packets - the default - everything that arrives behind the gap
# is thrown away and has to come again. At 128 kbps that is invisible; at the
# 1.2 Mbps of a 24-bit FLAC station it is most of a second each time, and the
# backlog never got above 16 KB no matter how big the buffer was. With both of
# these the same station holds 130 KB of backlog and reports no underruns at
# all. 24 out-of-order buffers is one receive window's worth at this MSS.
CONFIG_LWIP_TCP_SACK_OUT=y
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=24
